import numpy as np
import pandas as pd
from src.interpolator import LinearInterpolator

class Fluid:
    
    Pstd = 1
    Tstd = 293.15
    
    def __init__(self, rho_c: float, xa: float, xy: float, T: float, data: pd):
        
        self.rho_c = rho_c # плотность при стандартных условиях [кг/м³]
        self.xa = xa / 100 # мольная доля азота (N₂) [%]
        self.xy = xy / 100 # мольная доля диоксида углерода (CO₂) [%]
        self.T = T # температура системы, задаётся один раз [К]
        self.data = data # данные для расчёта динамической вязкости
        self.M = (rho_c * 8.314462618 * self.Tstd) / (self.Pstd * 101325) # молярная масса [кг/моль]
        
    def get_z(self, P: float) -> float:
        
        # Расчёт коэффициента сверхжимаемости Z по GERG-91
        P = P * 101325 / 10**6
        rho_c = self.rho_c
        T = self.T
        xa = self.xa
        xy = self.xy
        xe = 1 - xa - xy # эквивалент углеводорода
        zstd = 1 - (0.0741 * rho_c - 0.006 - 0.063 * xa - 0.0575 * xy)**2
        Me = (24.05525 * zstd * rho_c - 28.0135 * xa - 44.01 * xy) / xe
        H = 128.64 + 47.479 * Me
        # B-коэффициенты
        B1 = (-0.425468 + 2.865 * 10**-3 * T - 4.62073 * 10**-6 * T**2 + (8.77118 * 10**-4 - 5.56281 * 10**-6 * T + 8.8151 * 10**-9 * T**2) * H + (-8.24747 * 10**-7 + 4.31436 * 10**-9 * T - 6.08319 * 10**-12 * T**2) * H**2)
        B2 = -0.1446 + 7.4091 * 10**-4 * T - 9.1195 * 10**-7 * T**2
        B23 = -0.339693 + 1.61176 * 10**-3 * T - 2.04429 * 10**-6 * T**2
        B3 = -0.86834 + 4.0376 * 10**-3 * T - 5.1657 * 10**-6 * T**2
        # C-коэффициенты
        C1 = (-0.302488 + 1.95861 * 10**-3 * T - 3.16302 * 10**-6 * T**2 + (6.46422 * 10**-4 - 4.22876 * 10**-6 * T + 6.88157 * 10**-9 * T**2) * H + (-3.32805 * 10**-7 + 2.2316 * 10**-9 * T - 3.67713 * 10**-12 * T**2) * H**2)
        C2 = 7.8498 * 10**-3 - 3.9895 * 10**-5 * T + 6.1187 * 10**-8 * T**2
        C3 = 2.0513 * 10**-3 + 3.4888 * 10**-5 * T - 8.3703 * 10**-8 * T**2
        C223 = 5.52066 * 10**-3 - 1.68609 * 10**-5 * T + 1.57169 * 10**-8 * T**2
        C233 = 3.58783 * 10**-3 + 8.06674 * 10**-6 * T - 3.25798 * 10**-8 * T**2
        B = 0.72 + 1.875 * 10**-5 * (320 - T)**2
        C = 0.92 + 0.0013 * (T - 270)
        # Смесевые коэффициенты Bm и Cm
        Bm = (xe**2 * B1 + xe * xa * B * (B1 + B2) - 1.73 * xe * xy * (B1 * B3)**0.5 + xa**2 * B2 + 2 * xa * xy * B23 + xy**2 * B3)
        Cm = (xe**3 * C1 + 3 * xe**2 * xa * C * (C1**2 * C2)**(1/3) + 2.76 * xe**2 * xy * (C1**2 * C3)**(1/3) + 3 * xe * xa**2 * C * (C1 * C2**2)**(1/3) + 6.6 * xe * xa * xy * (C1 * C2 * C3)**(1/3) + 2.76 * xe * xy**2 * (C1 * C3**2)**(1/3) + xa**3 * C2 + 3 * xa**2 * xy * C223 + 3 * xa * xy**2 * C233 + xy**3 * C3)
        # Решение кубического уравнения
        b = (10**3 * P) / (2.7715 * T)
        B0 = b * Bm
        C0 = b**2 * Cm
        A1 = 1 + B0
        A0 = 1 + 1.5 * (B0 + C0)
        A2 = (A0 + (A0**2 - A1**3)**0.5)**(1/3)
        z = (1 + A2 + A1/A2) / 3
        return z
        
    def get_bg(self, P: float) -> float:
        
        # Объёмный коэффициент Bg
        z = self.get_z(P)
        bg = (self.Pstd * z * self.T) / (P * self.Tstd)
        return bg
        
    def get_rho(self, P: float) -> float:
        
        # Плотность газа rho
        rho = (P * 101325 * self.M) / (self.get_z(P) * 8.314462618 * self.T)
        return rho

    def get_mu(self, P: float) -> float:
        
        # Динамическая вязкость mu через интерполятор
        return LinearInterpolator(self.data['pressure, atm'], self.data['viscosity, cP']).predict(P)